thermalStorage/caseDistributor/constant/thermophysicalProperties_bouss
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleEnthalpy;
}

pRef            100000;

mixture
{
    specie
    {
        nMoles          1;
        molWeight       18;
    }
    equationOfState 
      {
	rho0 998.3;
	T0   293.15;
	beta  0.000207;
      }
    thermodynamics
    {
        Cp              4182;
        Hf              0;
    }
    transport
    {
        mu              1000e-06;
        Pr              7.01;
    }
}


// ************************************************************************* //
