thermalStorage/caseDistributor/constant/thermophysicalProperties_pol
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState icoPolynomial;
    specie          specie;
    energy          sensibleEnthalpy;
}

pRef            100000;

mixture
{
    specie
    {
        nMoles          1;
        molWeight       18;
    }
    equationOfState
      {
	rhoCoeffs<8> (838.46 1.4 -0.003 3.72e-07 0.0 0.0 0.0 0.0);
      }
    thermodynamics
      {
	Hf -286000.0;
	CpCoeffs<8> (12010.1 -80.4 0.31 -0.000538 3.62e-07 0.0 0.0 0.0);
	Sf 69.95;
    }
    transport
      {
	kappaCoeffs<8> (-0.869 0.00895 -1.58e-05 7.97e-09 0.0 0.0 0.0 0.0);
	muCoeffs<8> (0.0374 -3.093e-4 9.609e-7 -1.32e-9 6.746e-13 0 0.0 0.0);
      }
   
    
}


// ************************************************************************* //
