thermalStorage/caseDistributor/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-2.4                            |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 1e5;    
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    "wall.*"
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
