thermalStorage/caseDistributor/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(nuTilda)   cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(T)        cellLimited Gauss linear 1;
    grad(omega)     cellLimited Gauss linear 1;
    grad(epsilon)   cellLimited Gauss linear 1;
    grad(q)         cellLimited Gauss linear 1;
    grad(zeta)      cellLimited Gauss linear 1;
    grad(v2)        cellLimited Gauss linear 1;
    grad(f)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwindV grad(U);
    div(phi,h)      Gauss upwind;
    div(phi,e)      Gauss upwind;
    div(phi,k)      bounded Gauss linearUpwind grad(k); 
    div(phi,epsilon) bounded Gauss linearUpwind grad(epsilon);
    div(phi,R)      Gauss upwind;
    div(phi,K)      Gauss linear;
    div(phi,Ekp)    Gauss linear;
    div(R)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default        Gauss linear limited 0.333;
}

interpolationSchemes
{
    default        linear;
}

snGradSchemes
{
    default        limited 0.333;
}


// ************************************************************************* //
